{
  "id": "arraylist-vs-linkedlist",
  "title": "What is the difference between ArrayList and LinkedList?",
  "answers": {
    "junior": "ArrayList stores elements in a dynamic array while LinkedList stores elements as nodes with pointers. ArrayList is faster for accessing elements by index, while LinkedList is faster for adding or removing elements from the beginning or middle.",
    "middle": "Key differences: 1) Internal Structure - ArrayList uses a resizable array (default capacity 10), LinkedList uses a doubly-linked list. 2) Performance - ArrayList: O(1) random access, O(n) insertion/deletion in middle; LinkedList: O(n) random access, O(1) insertion/deletion at ends. 3) Memory - ArrayList is more memory efficient but wastes space during resize; LinkedList requires extra memory for prev/next pointers. 4) Use Cases - ArrayList for frequent access, LinkedList for frequent insertions/deletions. Both implement List interface.",
    "senior": "Detailed comparison: ArrayList maintains a backing array with growth factor of 1.5x (newCapacity = oldCapacity + (oldCapacity >> 1)). System.arraycopy is used for element shifting during insertions. LinkedList is a doubly-linked list implementing both List and Deque interfaces, providing efficient addFirst/addLast operations. Iterator performance: ArrayList's iterator is fail-fast and lightweight, LinkedList's iterator maintains node references. Memory locality: ArrayList has better cache performance due to contiguous memory. For iteration-heavy operations, ArrayList is faster despite LinkedList's O(n) vs O(n) theoretical complexity due to CPU cache optimization.",
    "tricky": "Implementation details: ArrayList's remove() operation doesn't shrink capacity (manual trimToSize() needed), causing memory leaks in shrinking collections. LinkedList maintains size counter and head/tail references for O(1) size(). Sublist views: ArrayList.subList() returns a view backed by the original list; modifications require careful synchronization. LinkedList isn't thread-safe; CopyOnWriteArrayList provides thread-safety at cost of write operations. For random access patterns, ArrayList is 10-100x faster even for small datasets due to CPU cache lines. ArrayList serialization is optimized (only used array portion), LinkedList serializes all nodes."
  }
}
