{
  "id": "what-are-inner-classes-in-java-and-when-would-you-use-them",
  "title": "What are inner classes in Java, and when would you use them?",
  "answers": {
    "junior": "Inner classes in Java are classes defined within another class, providing logical grouping and access to the outer class's members including private fields. Java supports four types: member inner classes (non-static), static nested classes, local inner classes (defined within methods), and anonymous inner classes (unnamed classes created inline).",
    "middle": "Inner classes in Java are classes defined within another class, providing logical grouping and access to the outer class's members including private fields. Java supports four types: member inner classes (non-static), static nested classes, local inner classes (defined within methods), and anonymous inner classes (unnamed classes created inline). Member inner classes have access to all members of the enclosing class and implicitly hold a reference to the outer class instance, created via `Outer.Inner inner = outer.new Inner();`. Static nested classes, declared with static keyword, don't have access to instance members of the outer class and are instantiated as `Outer.Inner inner = new Outer.Inner();`, behaving like top-level classes but namespaced within the outer class. Use inner classes for helper classes tightly coupled to the outer class (like `Map.Entry` in HashMap), implementing callbacks or event listeners where the inner class needs access to outer state, or creating iterator implementations for custom collections.",
    "senior": "Inner classes in Java are classes defined within another class, providing logical grouping and access to the outer class's members including private fields. Java supports four types: member inner classes (non-static), static nested classes, local inner classes (defined within methods), and anonymous inner classes (unnamed classes created inline). Member inner classes have access to all members of the enclosing class and implicitly hold a reference to the outer class instance, created via `Outer.Inner inner = outer.new Inner();`. Static nested classes, declared with static keyword, don't have access to instance members of the outer class and are instantiated as `Outer.Inner inner = new Outer.Inner();`, behaving like top-level classes but namespaced within the outer class. Use inner classes for helper classes tightly coupled to the outer class (like `Map.Entry` in HashMap), implementing callbacks or event listeners where the inner class needs access to outer state, or creating iterator implementations for custom collections. Anonymous inner classes are excellent for one-time implementations like `button.addActionListener(new ActionListener() { public void actionPerformed(ActionEvent e) { /* handler code */ } });`, though lambdas (Java 8+) are now preferred for functional interfaces. Local inner classes defined in methods are useful when you need a named class with logic too complex for anonymous classes but only used within that method scope. Key benefits include encapsulation (hiding helper classes from external access), code organization (grouping related functionality), and cleaner code when the inner class is meaningless outside the outer class context.",
    "tricky": "Inner classes in Java are classes defined within another class, providing logical grouping and access to the outer class's members including private fields. Java supports four types: member inner classes (non-static), static nested classes, local inner classes (defined within methods), and anonymous inner classes (unnamed classes created inline). Member inner classes have access to all members of the enclosing class and implicitly hold a reference to the outer class instance, created via `Outer.Inner inner = outer.new Inner();`. Static nested classes, declared with static keyword, don't have access to instance members of the outer class and are instantiated as `Outer.Inner inner = new Outer.Inner();`, behaving like top-level classes but namespaced within the outer class. Use inner classes for helper classes tightly coupled to the outer class (like `Map.Entry` in HashMap), implementing callbacks or event listeners where the inner class needs access to outer state, or creating iterator implementations for custom collections. Anonymous inner classes are excellent for one-time implementations like `button.addActionListener(new ActionListener() { public void actionPerformed(ActionEvent e) { /* handler code */ } });`, though lambdas (Java 8+) are now preferred for functional interfaces. Local inner classes defined in methods are useful when you need a named class with logic too complex for anonymous classes but only used within that method scope. Key benefits include encapsulation (hiding helper classes from external access), code organization (grouping related functionality), and cleaner code when the inner class is meaningless outside the outer class context. Important considerations: non-static inner classes hold an implicit reference to the outer instance which can cause memory leaks if the inner instance outlives its intended scope, so prefer static nested classes when outer instance access isn't needed. Modern Java often favors composition over inner classes for testability, but inner classes remain valuable for tightly-coupled scenarios, event handling, and implementing design patterns like Iterator, Builder, or Strategy where the implementation is specific to the enclosing class."
  }
}